app/controllers/urls_controller.rb

  def index
    if params[:url] && params[:url][:url]
      @link = Url.find_or_create_by_url(params[:url][:url])
      unless @link.save
---
INSERT INTO `urls` (`token`, `url`, `created_at`) VALUES(NULL, 'http://www.openwire.com', '2009-04-09 18:40:23')
SELECT `urls`.id FROM `urls` WHERE (LOWER(`urls`.`url`) = BINARY 'http://www.freezerbox.com' AND `urls`.id <> 1) LIMIT 1
UPDATE `urls` SET `created_at` = '2009-04-09 18:40:23', `token` = 'l', `url` = 'http://www.openwire.com' WHERE `id` = 11

  def redirect
    url = Url.find(:first, :conditions => ['BINARY urls.token=?', params[:token]])
---
SELECT * FROM `urls` WHERE (`urls`.`token` = 'sdf') LIMIT 1